package oop04.abstraction;
/*
Date : 2015/05/21
Author: 김호영
Desc : 추상 클래스 문법
*/
/*
추상클래스를 상속하는 클래스는 반드시 추상 메소드를 
오버라이딩으로 사용
- 클래스는 1개 이상의 추상 메소드를 가지고 있으면 자동으로 
   추상클래스가 됨
- 추상 클래스는 클래스 객체를 만들수 없음
- 추상메소드가 있는 추상 클레스를 상속받은 클래스는
   반드시 추상메소드를 구현해야 객체를 생성할 수 있다. 
- 추상 클래스는 객체를 생성할 수 없음으로
   "추상 클래스 객체 = (추상클래스) 콘크리트 클래스" 와 같은
   방법과 같이 기능이 다 구현된 클래스 객체를 만들어 추상 클래스
   객체를 넘겨 주어야 사용할 수 있다.
- 추상 클래스를 구현한 클래스는 추상 클래스 타입으로 포함된다.
- 인터페이스는 추상 메소드만 존재하나 추상클래스는 추상메소드와
   일반 멤버 메소드가 같이 공존한다. 
*/
public class AbstractionSyntax {

}
